//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.01
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//  Rev. 1.00
//    Bug Fix:  Add setup item to enable/disable LEGACYT to EFI support when enable LEGACY_TO_EFI token.
//    Reason:   Function improvement.
//    Auditor:  Jimmy Chiu (Refer Grantley - Jacker Yeh)
//    Date:     Aug/24/2016
//
//***************************************************************************

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
// $Archive:  $
//
// $Author:  $
//
// $Revision:  $
//
// $Date: $
//
//*****************************************************************//
//*****************************************************************//

//**********************************************************************
//<AMI_FHDR_START>
//
// Name: DefaultFixedBootOrder.uni
//
// Description: DefaultFixedBootOrder strings.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
#string STR_FIXED_BOOT_ORDER_SUBTITLE   #language eng "FIXED BOOT ORDER Priorities"

#string STR_BOOT_OPTION          #language eng "Boot Option #%d"
#string STR_BOOT_OPTION_HELP     #language eng "Sets the system boot order"

#string STR_DISABLED            #language eng "Disable"
#string STR_BOOT_HDD			#language eng "Hard Disk"
#string STR_BOOT_HDD1			#language eng "Hard Disk1"
#string STR_BOOT_HDD2			#language eng "Hard Disk2"
#string STR_BOOT_HDD3			#language eng "Hard Disk3"
#string STR_BOOT_HDD4			#language eng "Hard Disk4"
#string STR_BOOT_HDD5			#language eng "Hard Disk5"
#string STR_BOOT_ODD            #language eng "CD/DVD"
#string STR_BOOT_NETWORK		#language eng "Network"
#string STR_BOOT_USBHDD			#language eng "USB Hard Disk"
#string STR_BOOT_USBODD			#language eng "USB CD/DVD"
#string STR_BOOT_USBFDD			#language eng "USB Floppy"
#string STR_BOOT_USBKEY			#language eng "USB Key"
#string STR_BOOT_USBLAN			#language eng "USB Lan"
#string STR_BOOT_USB            #language eng "USB Device"
#string STR_BOOT_DUAL_HDD       #language eng "Hard Disk"
#string STR_BOOT_DUAL_HDD1      #language eng "Hard Disk1"
#string STR_BOOT_DUAL_HDD2      #language eng "Hard Disk2"
#string STR_BOOT_DUAL_HDD3      #language eng "Hard Disk3"
#string STR_BOOT_DUAL_HDD4      #language eng "Hard Disk4"
#string STR_BOOT_DUAL_HDD5      #language eng "Hard Disk5"
#string STR_BOOT_DUAL_ODD       #language eng "CD/DVD"
#string STR_BOOT_DUAL_NETWORK   #language eng "Network"
#string STR_BOOT_DUAL_USBHDD    #language eng "USB Hard Disk"
#string STR_BOOT_DUAL_USBODD    #language eng "USB CD/DVD"
#string STR_BOOT_DUAL_USBFDD    #language eng "USB Floppy"
#string STR_BOOT_DUAL_USBKEY    #language eng "USB Key"
#string STR_BOOT_DUAL_USBLAN    #language eng "USB Lan"
#string STR_BOOT_DUAL_USB       #language eng "USB Device"

#string STR_BOOT_UEFI_HDD		#language eng "Hard Disk"
#string STR_BOOT_UEFI_HDD1		#language eng "Hard Disk1"
#string STR_BOOT_UEFI_HDD2		#language eng "Hard Disk2"
#string STR_BOOT_UEFI_HDD3		#language eng "Hard Disk3"
#string STR_BOOT_UEFI_HDD4		#language eng "Hard Disk4"
#string STR_BOOT_UEFI_HDD5		#language eng "Hard Disk5"
#string STR_BOOT_UEFI_ODD       #language eng "CD/DVD"
#string STR_BOOT_UEFI_NETWORK	#language eng "Network"
#string STR_BOOT_UEFI_USBHDD	#language eng "USB Hard Disk"
#string STR_BOOT_UEFI_USBODD	#language eng "USB CD/DVD"
#string STR_BOOT_UEFI_USBFDD	#language eng "USB Floppy"
#string STR_BOOT_UEFI_USBKEY	#language eng "USB Key"
#string STR_BOOT_UEFI_USBLAN	#language eng "USB Lan"
#string STR_BOOT_UEFI_USB           #language eng "USB Device"
#string STR_BOOT_UEFI_APPLICATION	#language eng "UEFI AP"
#string STR_BOOT_UEFI_DEVICE        #language eng "UEFI Device"
#string STR_BOOT_DUAL_UEFI_HDD		#language eng "UEFI Hard Disk"
#string STR_BOOT_DUAL_UEFI_HDD1		#language eng "UEFI Hard Disk1"
#string STR_BOOT_DUAL_UEFI_HDD2		#language eng "UEFI Hard Disk2"
#string STR_BOOT_DUAL_UEFI_HDD3		#language eng "UEFI Hard Disk3"
#string STR_BOOT_DUAL_UEFI_HDD4		#language eng "UEFI Hard Disk4"
#string STR_BOOT_DUAL_UEFI_HDD5		#language eng "UEFI Hard Disk5"
#string STR_BOOT_DUAL_UEFI_ODD      #language eng "UEFI CD/DVD"
#string STR_BOOT_DUAL_UEFI_NETWORK	#language eng "UEFI Network"
#string STR_BOOT_DUAL_UEFI_USBHDD	#language eng "UEFI USB Hard Disk"
#string STR_BOOT_DUAL_UEFI_USBODD	#language eng "UEFI USB CD/DVD"
#string STR_BOOT_DUAL_UEFI_USBFDD	#language eng "UEFI USB Floppy"
#string STR_BOOT_DUAL_UEFI_USBKEY	#language eng "UEFI USB Key"
#string STR_BOOT_DUAL_UEFI_USBLAN	#language eng "UEFI USB Lan"
#string STR_BOOT_DUAL_UEFI_USB      #language eng "UEFI USB Device"
#string STR_BOOT_DUAL_UEFI_APPLICATION   #language eng "UEFI AP"
#string STR_BOOT_DUAL_UEFI_DEVICE        #language eng "UEFI Device"

#string STR_BOOT_MODE_SEL		    #language eng "Boot mode select"
                                    #language x-AMI "COMMN039" //SMCPKG_SUPPORT
#string STR_BOOT_MODE_SEL_HELP		#language eng "Select boot mode LEGACY/UEFI"
#string STR_BOOT_MODE_LEGACY		#language eng "LEGACY"
#string STR_BOOT_MODE_UEFI		    #language eng "UEFI"
#string STR_BOOT_MODE_DUAL		    #language eng "DUAL"

#string STR_HDD_BOOT_ORDER_SUBTITLE	    #language eng "Hard Disk Drive BBS Priorities"
#string STR_HDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available Hard Disk Drives."
#string STR_HDD1_BOOT_ORDER_SUBTITLE    #language eng "Hard Disk Drive 1 BBS Priorities"
#string STR_HDD1_BOOT_ORDER_HELP        #language eng "Specifies the Boot Device Priority sequence from available Hard Disk 1 Drives."
#string STR_HDD2_BOOT_ORDER_SUBTITLE    #language eng "Hard Disk Drive 2 BBS Priorities"
#string STR_HDD2_BOOT_ORDER_HELP        #language eng "Specifies the Boot Device Priority sequence from available Hard Disk 2 Drives."
#string STR_HDD3_BOOT_ORDER_SUBTITLE    #language eng "Hard Disk Drive 3 BBS Priorities"
#string STR_HDD3_BOOT_ORDER_HELP        #language eng "Specifies the Boot Device Priority sequence from available Hard Disk 3 Drives."
#string STR_HDD4_BOOT_ORDER_SUBTITLE    #language eng "Hard Disk Drive 4 BBS Priorities"
#string STR_HDD4_BOOT_ORDER_HELP        #language eng "Specifies the Boot Device Priority sequence from available Hard Disk 4 Drives."
#string STR_HDD5_BOOT_ORDER_SUBTITLE    #language eng "Hard Disk Drive 5 BBS Priorities"
#string STR_HDD5_BOOT_ORDER_HELP        #language eng "Specifies the Boot Device Priority sequence from available Hard Disk 5 Drives."
#string STR_ODD_BOOT_ORDER_SUBTITLE	    #language eng "CDROM/DVD Drive BBS Priorities"
#string STR_ODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available CDROM/DVD Drives."
#string STR_NETWORK_BOOT_ORDER_SUBTITLE #language eng "NETWORK Drive BBS Priorities"
#string STR_NETWORK_BOOT_ORDER_HELP     #language eng "Specifies the Boot Device Priority sequence from available NETWORK Drives."
#string STR_USBHDD_BOOT_ORDER_SUBTITLE	#language eng "USB Hard Disk Drive BBS Priorities"
#string STR_USBHDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Hard Disk Drives."
#string STR_USBKEY_BOOT_ORDER_SUBTITLE	#language eng "USB Key Drive BBS Priorities"
#string STR_USBKEY_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Key Drives."
#string STR_USBODD_BOOT_ORDER_SUBTITLE	#language eng "CDROM/DVD Drive BBS Priorities"
#string STR_USBODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available CDROM/DVD Drives."
#string STR_USBFDD_BOOT_ORDER_SUBTITLE	#language eng "USB Floppy Drive BBS Priorities"
#string STR_USBFDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Floppy Drives."
#string STR_USBLAN_BOOT_ORDER_SUBTITLE	#language eng "USB Lan Drive BBS Priorities"
#string STR_USBLAN_BOOT_ORDER_HELP      #language eng "Specifies the Boot Device Priority sequence from available USB Lan Drives."
#string STR_USB_BOOT_ORDER_SUBTITLE     #language eng "USB Drive BBS Priorities"
#string STR_USB_BOOT_ORDER_HELP         #language eng "Specifies the Boot Device Priority sequence from available USB Drives."


#string STR_UEFI_HDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI Hard Disk Drive BBS Priorities"
#string STR_UEFI_HDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk Drives."
#string STR_UEFI_HDD1_BOOT_ORDER_SUBTITLE   #language eng "UEFI Hard Disk 1 Drive BBS Priorities"
#string STR_UEFI_HDD1_BOOT_ORDER_HELP       #language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk 1 Drives."
#string STR_UEFI_HDD2_BOOT_ORDER_SUBTITLE   #language eng "UEFI Hard Disk 2 Drive BBS Priorities"
#string STR_UEFI_HDD2_BOOT_ORDER_HELP       #language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk 2 Drives."
#string STR_UEFI_HDD3_BOOT_ORDER_SUBTITLE   #language eng "UEFI Hard Disk 3 Drive BBS Priorities"
#string STR_UEFI_HDD3_BOOT_ORDER_HELP       #language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk 3 Drives."
#string STR_UEFI_HDD4_BOOT_ORDER_SUBTITLE   #language eng "UEFI Hard Disk 4 Drive BBS Priorities"
#string STR_UEFI_HDD4_BOOT_ORDER_HELP       #language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk 4 Drives."
#string STR_UEFI_HDD5_BOOT_ORDER_SUBTITLE   #language eng "UEFI Hard Disk 5 Drive BBS Priorities"
#string STR_UEFI_HDD5_BOOT_ORDER_HELP       #language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk 5 Drives."
#string STR_UEFI_ODD_BOOT_ORDER_SUBTITLE	#language eng "UEFI CDROM/DVD Drive BBS Priorities"
#string STR_UEFI_ODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI CDROM/DVD Drives."
#string STR_UEFI_NETWORK_BOOT_ORDER_SUBTITLE    #language eng "UEFI NETWORK Drive BBS Priorities"
#string STR_UEFI_NETWORK_BOOT_ORDER_HELP    #language eng "Specifies the Boot Device Priority sequence from available UEFI NETWORK Drives."
#string STR_UEFI_USBHDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Hard Disk Drive BBS Priorities"
#string STR_UEFI_USBHDD_BOOT_ORDER_HELP     #language eng "Specifies the Boot Device Priority sequence from available UEFI USB Hard Disk Drives."
#string STR_UEFI_USBODD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB CDROM/DVD Drive BBS Priorities"
#string STR_UEFI_USBODD_BOOT_ORDER_HELP     #language eng "Specifies the Boot Device Priority sequence from available UEFI USB CDROM/DVD Drives."
#string STR_UEFI_USBKEY_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Key Drive BBS Priorities"
#string STR_UEFI_USBKEY_BOOT_ORDER_HELP     #language eng "Specifies the Boot Device Priority sequence from available UEFI USB Key Drives."
#string STR_UEFI_USBFDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Floppy Drive BBS Priorities"
#string STR_UEFI_USBFDD_BOOT_ORDER_HELP     #language eng "Specifies the Boot Device Priority sequence from available UEFI USB Floppy Drives."
#string STR_UEFI_USBLAN_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Lan Drive BBS Priorities"
#string STR_UEFI_USBLAN_BOOT_ORDER_HELP		#language eng "Specifies the Boot Device Priority sequence from available UEFI USB Lan Drives."
#string STR_UEFI_APPLICATION_BOOT_ORDER_SUBTITLE	#language eng "UEFI Application Boot Priorities"
#string STR_UEFI_APPLICATION_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI Application."
#string STR_UEFI_DEVICE_BOOT_ORDER_SUBTITLE         #language eng "UEFI Device Boot Priorities"
#string STR_UEFI_DEVICE_BOOT_ORDER_HELP             #language eng "Specifies the Boot Device Priority sequence from available UEFI Devices."
#string STR_UEFI_USB_BOOT_ORDER_SUBTITLE            #language eng "UEFI USB Drive BBS Priorities"
#string STR_UEFI_USB_BOOT_ORDER_HELP                #language eng "Specifies the Boot Device Priority sequence from available UEFI USB Drives."

//Use for AMIBCP tool
#string STR_BCP_UEFI_DEFAULT_SUBTITLE   #language eng "BCP Uefi mode defualt priority setting"
#string STR_BCP_LEGACY_DEFAULT_SUBTITLE #language eng "BCP Legacy mode defualt priority setting"
#string STR_BCP_DUAL_DEFAULT_SUBTITLE   #language eng "BCP Dual mode defualt priority setting"

#string STR_FBO_GROUP_FORM_SUBTITLE     #language eng "FixedBootOrder Group Form"
#string STR_FBO_GROUP_FORM_HELP         #language eng "Group Go to item"

#string STR_LEGACY_BOOT_ORDER_1       #language eng "Boot Option #1"
                                      #language x-AMI "COMMN03B" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_2       #language eng "Boot Option #2"
                                      #language x-AMI "COMMN03C" //SMCPKG_SUPPORT  
#string STR_LEGACY_BOOT_ORDER_3       #language eng "Boot Option #3"
                                      #language x-AMI "COMMN03D" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_4       #language eng "Boot Option #4"
                                      #language x-AMI "COMMN03E" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_5       #language eng "Boot Option #5"
                                      #language x-AMI "COMMN03F" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_6       #language eng "Boot Option #6"
                                      #language x-AMI "COMMN040" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_7       #language eng "Boot Option #7"
                                      #language x-AMI "COMMN041" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_8       #language eng "Boot Option #8"
                                      #language x-AMI "COMMN042" //SMCPKG_SUPPORT
#string STR_LEGACY_BOOT_ORDER_9       #language eng "Boot Option #9"
                                      #language x-AMI "FBO109"  
#string STR_LEGACY_BOOT_ORDER_10      #language eng "Boot Option #10"
                                      #language x-AMI "FBO110"  
#string STR_LEGACY_BOOT_ORDER_11      #language eng "Boot Option #11"
                                      #language x-AMI "FBO111"  
#string STR_LEGACY_BOOT_ORDER_12      #language eng "Boot Option #12"
                                      #language x-AMI "FBO112"  
#string STR_LEGACY_BOOT_ORDER_13      #language eng "Boot Option #13"
                                      #language x-AMI "FBO113"  
#string STR_LEGACY_BOOT_ORDER_14      #language eng "Boot Option #14"
                                      #language x-AMI "FBO114"  
#string STR_LEGACY_BOOT_ORDER_15      #language eng "Boot Option #15"
                                      #language x-AMI "FBO115"  
#string STR_LEGACY_BOOT_ORDER_16      #language eng "Boot Option #16"
                                      #language x-AMI "FBO116"  
#string STR_LEGACY_BOOT_ORDER_17      #language eng "Boot Option #17"
                                      #language x-AMI "FBO117"  
#string STR_LEGACY_BOOT_ORDER_18      #language eng "Boot Option #18"
                                      #language x-AMI "FBO118"  
#string STR_LEGACY_BOOT_ORDER_19      #language eng "Boot Option #19"
                                      #language x-AMI "FBO119"  
#string STR_LEGACY_BOOT_ORDER_20      #language eng "Boot Option #20"
                                      #language x-AMI "FBO120"  
#string STR_LEGACY_BOOT_ORDER_21      #language eng "Boot Option #21"
                                      #language x-AMI "FBO121"  
#string STR_LEGACY_BOOT_ORDER_22      #language eng "Boot Option #22"
                                      #language x-AMI "FBO122"  
#string STR_LEGACY_BOOT_ORDER_23      #language eng "Boot Option #23"
                                      #language x-AMI "FBO123"  
#string STR_LEGACY_BOOT_ORDER_24      #language eng "Boot Option #24"
                                      #language x-AMI "FBO124"  
#string STR_LEGACY_BOOT_ORDER_25      #language eng "Boot Option #25"
                                      #language x-AMI "FBO125"  
#string STR_LEGACY_BOOT_ORDER_26      #language eng "Boot Option #26"
                                      #language x-AMI "FBO126"  
#string STR_LEGACY_BOOT_ORDER_27      #language eng "Boot Option #27"
                                      #language x-AMI "FBO127"  
#string STR_LEGACY_BOOT_ORDER_28      #language eng "Boot Option #28"
                                      #language x-AMI "FBO128"  
#string STR_LEGACY_BOOT_ORDER_29      #language eng "Boot Option #29"
                                      #language x-AMI "FBO129"  
#string STR_LEGACY_BOOT_ORDER_30      #language eng "Boot Option #30"
                                      #language x-AMI "FBO130"  
#string STR_LEGACY_BOOT_ORDER_31      #language eng "Boot Option #31"
                                      #language x-AMI "FBO131"  
#string STR_LEGACY_BOOT_ORDER_32      #language eng "Boot Option #32"
                                      #language x-AMI "FBO132"  
#string STR_LEGACY_BOOT_ORDER_33      #language eng "Boot Option #33"
                                      #language x-AMI "FBO133"  
#string STR_LEGACY_BOOT_ORDER_34      #language eng "Boot Option #34"
                                      #language x-AMI "FBO134" 
#string STR_LEGACY_BOOT_ORDER_35      #language eng "Boot Option #35"
                                      #language x-AMI "FBO135" 
#string STR_LEGACY_BOOT_ORDER_36      #language eng "Boot Option #36"
                                      #language x-AMI "FBO136"
                                                                
#string STR_UEFI_BOOT_ORDER_1       #language eng "Boot Option #1"
                                    #language x-AMI "COMMN043" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_2       #language eng "Boot Option #2"
                                    #language x-AMI "COMMN044" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_3       #language eng "Boot Option #3"
                                    #language x-AMI "COMMN045" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_4       #language eng "Boot Option #4"
                                    #language x-AMI "COMMN046" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_5       #language eng "Boot Option #5"
                                    #language x-AMI "COMMN047" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_6       #language eng "Boot Option #6"
                                    #language x-AMI "COMMN048" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_7       #language eng "Boot Option #7"
                                    #language x-AMI "COMMN049" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_8       #language eng "Boot Option #8"
                                    #language x-AMI "COMMN04A" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_9       #language eng "Boot Option #9"
                                    #language x-AMI "COMMN04B" //SMCPKG_SUPPORT
#string STR_UEFI_BOOT_ORDER_10      #language eng "Boot Option #10"
                                    #language x-AMI "FBO210"  
#string STR_UEFI_BOOT_ORDER_11      #language eng "Boot Option #11"
                                    #language x-AMI "FBO211"  
#string STR_UEFI_BOOT_ORDER_12      #language eng "Boot Option #12"
                                    #language x-AMI "FBO212"  
#string STR_UEFI_BOOT_ORDER_13      #language eng "Boot Option #13"
                                    #language x-AMI "FBO213"  
#string STR_UEFI_BOOT_ORDER_14      #language eng "Boot Option #14"
                                    #language x-AMI "FBO214"  
#string STR_UEFI_BOOT_ORDER_15      #language eng "Boot Option #15"
                                    #language x-AMI "FBO215"  
#string STR_UEFI_BOOT_ORDER_16      #language eng "Boot Option #16"
                                    #language x-AMI "FBO216"  
#string STR_UEFI_BOOT_ORDER_17      #language eng "Boot Option #17"
                                    #language x-AMI "FBO217"  
#string STR_UEFI_BOOT_ORDER_18      #language eng "Boot Option #18"
                                    #language x-AMI "FBO218"  
#string STR_UEFI_BOOT_ORDER_19      #language eng "Boot Option #19"
                                    #language x-AMI "FBO219"  
#string STR_UEFI_BOOT_ORDER_20      #language eng "Boot Option #20"
                                    #language x-AMI "FBO220"  
#string STR_UEFI_BOOT_ORDER_21      #language eng "Boot Option #21"
                                    #language x-AMI "FBO221"  
#string STR_UEFI_BOOT_ORDER_22      #language eng "Boot Option #22"
                                    #language x-AMI "FBO222"  
#string STR_UEFI_BOOT_ORDER_23      #language eng "Boot Option #23"
                                    #language x-AMI "FBO223"  
#string STR_UEFI_BOOT_ORDER_24      #language eng "Boot Option #24"
                                    #language x-AMI "FBO224"  
#string STR_UEFI_BOOT_ORDER_25      #language eng "Boot Option #25"
                                    #language x-AMI "FBO225"  
#string STR_UEFI_BOOT_ORDER_26      #language eng "Boot Option #26"
                                    #language x-AMI "FBO226"  
#string STR_UEFI_BOOT_ORDER_27      #language eng "Boot Option #27"
                                    #language x-AMI "FBO227"  
#string STR_UEFI_BOOT_ORDER_28      #language eng "Boot Option #28"
                                    #language x-AMI "FBO228"  
#string STR_UEFI_BOOT_ORDER_29      #language eng "Boot Option #29"
                                    #language x-AMI "FBO229"  
#string STR_UEFI_BOOT_ORDER_30      #language eng "Boot Option #30"
                                    #language x-AMI "FBO230"  
#string STR_UEFI_BOOT_ORDER_31      #language eng "Boot Option #31"
                                    #language x-AMI "FBO231"  
#string STR_UEFI_BOOT_ORDER_32      #language eng "Boot Option #32"
                                    #language x-AMI "FBO232"  
#string STR_UEFI_BOOT_ORDER_33      #language eng "Boot Option #33"
                                    #language x-AMI "FBO233"  
#string STR_UEFI_BOOT_ORDER_34      #language eng "Boot Option #34"
                                    #language x-AMI "FBO234" 
#string STR_UEFI_BOOT_ORDER_35      #language eng "Boot Option #35"
                                    #language x-AMI "FBO235" 
#string STR_UEFI_BOOT_ORDER_36      #language eng "Boot Option #36"
                                    #language x-AMI "FBO236"
                                
#string STR_DUAL_BOOT_ORDER_1       #language eng "Boot Option #1"
                                    #language x-AMI "COMMN04C" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_2       #language eng "Boot Option #2"
                                    #language x-AMI "COMMN04D" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_3       #language eng "Boot Option #3"
                                    #language x-AMI "COMMN04E" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_4       #language eng "Boot Option #4"
                                    #language x-AMI "COMMN04F" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_5       #language eng "Boot Option #5"
                                    #language x-AMI "COMMN050" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_6       #language eng "Boot Option #6"
                                    #language x-AMI "COMMN051" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_7       #language eng "Boot Option #7"
                                    #language x-AMI "COMMN052" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_8       #language eng "Boot Option #8"
                                    #language x-AMI "COMMN053" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_9       #language eng "Boot Option #9"
                                    #language x-AMI "COMMN054" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_10      #language eng "Boot Option #10"
                                    #language x-AMI "COMMN055" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_11      #language eng "Boot Option #11"
                                    #language x-AMI "COMMN056" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_12      #language eng "Boot Option #12"
                                    #language x-AMI "COMMN057" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_13      #language eng "Boot Option #13"
                                    #language x-AMI "COMMN058" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_14      #language eng "Boot Option #14"
                                    #language x-AMI "COMMN059" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_15      #language eng "Boot Option #15"
                                    #language x-AMI "COMMN05A" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_16      #language eng "Boot Option #16"
                                    #language x-AMI "COMMN05B" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_17      #language eng "Boot Option #17"
                                    #language x-AMI "COMMN05C" //SMCPKG_SUPPORT
#string STR_DUAL_BOOT_ORDER_18      #language eng "Boot Option #18"
                                    #language x-AMI "FBO318"  
#string STR_DUAL_BOOT_ORDER_19      #language eng "Boot Option #19"
                                    #language x-AMI "FBO319"  
#string STR_DUAL_BOOT_ORDER_20      #language eng "Boot Option #20"
                                    #language x-AMI "FBO320"  
#string STR_DUAL_BOOT_ORDER_21      #language eng "Boot Option #21"
                                    #language x-AMI "FBO321"  
#string STR_DUAL_BOOT_ORDER_22      #language eng "Boot Option #22"
                                    #language x-AMI "FBO322"  
#string STR_DUAL_BOOT_ORDER_23      #language eng "Boot Option #23"
                                    #language x-AMI "FBO323"  
#string STR_DUAL_BOOT_ORDER_24      #language eng "Boot Option #24"
                                    #language x-AMI "FBO324"  
#string STR_DUAL_BOOT_ORDER_25      #language eng "Boot Option #25"
                                    #language x-AMI "FBO325"  
#string STR_DUAL_BOOT_ORDER_26      #language eng "Boot Option #26"
                                    #language x-AMI "FBO326"  
#string STR_DUAL_BOOT_ORDER_27      #language eng "Boot Option #27"
                                    #language x-AMI "FBO327"  
#string STR_DUAL_BOOT_ORDER_28      #language eng "Boot Option #28"
                                    #language x-AMI "FBO328"  
#string STR_DUAL_BOOT_ORDER_29      #language eng "Boot Option #29"
                                    #language x-AMI "FBO329"  
#string STR_DUAL_BOOT_ORDER_30      #language eng "Boot Option #30"
                                    #language x-AMI "FBO330"  
#string STR_DUAL_BOOT_ORDER_31      #language eng "Boot Option #31"
                                    #language x-AMI "FBO331"  
#string STR_DUAL_BOOT_ORDER_32      #language eng "Boot Option #32"
                                    #language x-AMI "FBO332"  
#string STR_DUAL_BOOT_ORDER_33      #language eng "Boot Option #33"
                                    #language x-AMI "FBO333"  
#string STR_DUAL_BOOT_ORDER_34      #language eng "Boot Option #34"
                                    #language x-AMI "FBO334" 
#string STR_DUAL_BOOT_ORDER_35      #language eng "Boot Option #35"
                                    #language x-AMI "FBO335" 
#string STR_DUAL_BOOT_ORDER_36      #language eng "Boot Option #36"
                                    #language x-AMI "FBO336"
				    
#string STR_LEGACYTOEFI_SUPPORT     #language eng "LEGACY to EFI support"
                                    #language x-AMI "COMMN03A" //SMCPKG_SUPPORT
#string STR_LEGACYTOEFI_SUPPORT_HELP #language eng "Enabled: System is able to boot to EFI OS after boot failed from Legacy boot order."
#string STR_ENABLED                 #language eng "Enabled"
#string STR_DISABLED                #language eng "Disabled"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
